aws-samples/aws-stm32-ml-at-edge-accelerator/stm32/Middleware/ARM/trusted-firmware-m/platform/ext/target/cypress/psoc64/libs/mtb-pdl-cat1/drivers/source/cy_pra_cfg.c
/*******************************************************************************
* Function Name: Cy_PRA_SystemConfig
****************************************************************************//**
*
* Validates \ref cy_stc_pra_system_config_t and applies the provided
* settings.
*
* \param devConfig The device configuration structure initialized with
* Device Configurator.
*
* \return \ref cy_en_pra_status_t
*
* \funcusage
* \snippet pra/snippet/main.c snippet_Cy_PRA_SystemConfig
*
*******************************************************************************/
cy_en_pra_status_t Cy_PRA_SystemConfig(const cy_stc_pra_system_config_t *devConfig)
{
    cy_en_pra_status_t status;

#if (CY_CPU_CORTEX_M4)
    (void) devConfig;
    status = CY_PRA_STATUS_SUCCESS;
#else

    cy_en_sysclk_status_t sysClkStatus;

    /* Validates the input parameters */
    status = Cy_PRA_ValidateSystemConfig(devConfig);
    if (CY_PRA_STATUS_SUCCESS != status)
    {
        return status;
    }

    /* Sets the worst case memory wait states (! ultra low power, 150 MHz), update - at the end */
    Cy_SysLib_SetWaitStates(false, CY_PRA_150MHZ_FREQUENCY);

    if (devConfig->powerEnable)
    {
        status = Cy_PRA_PowerInit(devConfig);
        if (CY_PRA_STATUS_SUCCESS != status)
        {
            return status;
        }
    }

    if(CY_SRSS_PILO_PRESENT)
    {
        /* Enables all source clocks */
        if (Cy_SysClk_PiloIsEnabled())
        {
            if (!devConfig->piloEnable)
            {
                Cy_SysClk_PiloDisable();
            }
        }
        /* When the PILO state changes DISABLE -> ENABLE, enable only PILO.
         * Ignore, if PILO is already enabled */
        else
        {
            if (devConfig->piloEnable)
            {
                SystemCoreClockUpdate();
                Cy_PRA_PiloInit();
            }
        }
    }

    if (_FLD2BOOL(BACKUP_CTL_WCO_EN, BACKUP_CTL))
    {
        if (!devConfig->wcoEnable)
        {
            /* Wait 4 WCO cycles before it is disabled */
            Cy_SysLib_DelayUs(WCO_DISABLE_DELAY_US);
            Cy_SysClk_WcoDisable();
        }
    }
    /* When the WCO state changes DISABLE -> ENABLE, enable only WCO.
     * Ignore, if WCO is already enabled */
    else
    {
        if (devConfig->wcoEnable)
        {
            SystemCoreClockUpdate();
            status = Cy_PRA_WcoInit(devConfig);
            if (CY_PRA_STATUS_SUCCESS != status)
            {
                return status;
            }
        }
    }

    if (devConfig->clkLFEnable)
    {
        status = Cy_PRA_ClkLfInit(devConfig->clkLfSource);
        if (CY_PRA_STATUS_SUCCESS != status)
        {
            return status;
        }
    }

#if defined(CY_IP_MXBLESS)
    if (Cy_BLE_EcoIsEnabled())
    {
        if (!devConfig->clkAltHfEnable)
        {
            Cy_BLE_EcoReset();
        }
    }
    /* When the BLE_ECO state changes DISABLE -> ENABLE, enable only BLE_ECO.
     * Ignore, if BLE_ECO is already enabled */
    else
    {
        if (devConfig->clkAltHfEnable)
        {
            SystemCoreClockUpdate();
            status = Cy_PRA_AltHfInit(devConfig);
            if (CY_PRA_STATUS_SUCCESS != status)
            {
                return status;
            }
        }
    }
#endif /* CY_IP_MXBLESS */

    if(CY_SYSCLK_ECOSTAT_STABLE == Cy_SysClk_EcoGetStatus())
    {
        if (!devConfig->ecoEnable)
        {
            Cy_SysClk_EcoDisable();
        }
    }
    /* When the ECO state changes DISABLE -> ENABLE, enable only ECO.
     * Ignore, if ECO is already enabled */
    else
    {
        if (devConfig->ecoEnable)
        {
            SystemCoreClockUpdate();
            status = Cy_PRA_EcoInit(devConfig);
            if (CY_PRA_STATUS_SUCCESS != status)
            {
                return status;
            }
        }
    }

    if (devConfig->extClkEnable)
    {
        Cy_PRA_ExtClkInit(devConfig);
    }

    if (devConfig->clkFastEnable)
    {
        Cy_SysClk_ClkFastSetDivider(devConfig->clkFastDiv);
    }

    if (devConfig->clkPeriEnable)
    {
        Cy_SysClk_ClkPeriSetDivider(devConfig->clkPeriDiv);
    }

    if (devConfig->clkSlowEnable)
    {
        Cy_SysClk_ClkSlowSetDivider(devConfig->clkSlowDiv);
    }

    if ((devConfig->path0Src == CY_SYSCLK_CLKPATH_IN_WCO) &&
        (devConfig->hf0Source == CY_SYSCLK_CLKHF_IN_CLKPATH0))
    {
        /* Configure HFCLK0 to temporarily run from IMO to initialize other clocks */
        sysClkStatus = Cy_SysClk_ClkPathSetSource(CY_PRA_CLKPATH_1, CY_SYSCLK_CLKPATH_IN_IMO);
        if (CY_SYSCLK_SUCCESS != sysClkStatus)
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX1;
        }
        sysClkStatus = Cy_SysClk_ClkHfSetSource(CY_PRA_CLKHF_0, CY_SYSCLK_CLKHF_IN_CLKPATH1);
        if (CY_SYSCLK_SUCCESS != sysClkStatus)
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_CLKHF0;
        }
    }
    else
    {
        sysClkStatus = Cy_SysClk_ClkPathSetSource(CY_PRA_CLKPATH_1, devConfig->path1Src);
        if (CY_SYSCLK_SUCCESS != sysClkStatus)
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX1;
        }
    }

    /* Configures Path Clocks */

    if (devConfig->path0Enable)
    {
        sysClkStatus = Cy_SysClk_ClkPathSetSource(CY_PRA_CLKPATH_0, devConfig->path0Src);
        if (CY_SYSCLK_SUCCESS != sysClkStatus)
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX0;
        }
    }

    if (devConfig->path2Enable)
    {
        sysClkStatus = Cy_SysClk_ClkPathSetSource(CY_PRA_CLKPATH_2, devConfig->path2Src);
        if (CY_SYSCLK_SUCCESS != sysClkStatus)
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX2;
        }
    }

    if ((devConfig->path3Enable) && (CY_PRA_CLKPATH_3 < CY_SRSS_NUM_CLKPATH))
    {
        sysClkStatus = Cy_SysClk_ClkPathSetSource(CY_PRA_CLKPATH_3, devConfig->path3Src);
        if (CY_SYSCLK_SUCCESS != sysClkStatus)
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX3;
        }
    }

    if ((devConfig->path4Enable) && (CY_PRA_CLKPATH_4 < CY_SRSS_NUM_CLKPATH))
    {
        sysClkStatus = Cy_SysClk_ClkPathSetSource(CY_PRA_CLKPATH_4, devConfig->path4Src);
        if (CY_SYSCLK_SUCCESS != sysClkStatus)
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX4;
        }
    }

    if ((devConfig->path5Enable) && (CY_PRA_CLKPATH_5 < CY_SRSS_NUM_CLKPATH))
    {
        sysClkStatus = Cy_SysClk_ClkPathSetSource(CY_PRA_CLKPATH_5, devConfig->path5Src);
        if (CY_SYSCLK_SUCCESS != sysClkStatus)
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX5;
        }
    }

    if(Cy_SysClk_FllIsEnabled())
    {
        /* Disables FLL when its state changes ENABLE -> DISABLE */
        if (!devConfig->fllEnable)
        {
            sysClkStatus = Cy_SysClk_FllDisable();

            if (CY_SYSCLK_SUCCESS != sysClkStatus)
            {
                return CY_PRA_STATUS_ERROR_PROCESSING_FLL0;
            }
        }
    }
    /* When the FLL state changes DISABLE -> ENABLE, enable only FLL.
     * Ignore, if FLL is already enabled */
    else
    {
        if(devConfig->fllEnable)
        {
            SystemCoreClockUpdate();
            status = Cy_PRA_FllInit(devConfig);

            if (CY_PRA_STATUS_SUCCESS != status)
            {
                return status;
            }
        }
    }

    /* CLK_HF0 Init */
    sysClkStatus = Cy_SysClk_ClkHfSetSource(CY_PRA_CLKHF_0, devConfig->hf0Source);
    if (CY_SYSCLK_SUCCESS != sysClkStatus)
    {
        return CY_PRA_STATUS_ERROR_PROCESSING_CLKHF0;
    }
    sysClkStatus = Cy_SysClk_ClkHfSetDivider(CY_PRA_CLKHF_0, devConfig->hf0Divider);
    if (CY_SYSCLK_SUCCESS != sysClkStatus)
    {
        return CY_PRA_STATUS_ERROR_PROCESSING_CLKHF0;
    }

    if ((devConfig->path0Src == CY_SYSCLK_CLKPATH_IN_WCO) && (devConfig->hf0Source == CY_SYSCLK_CLKHF_IN_CLKPATH0))
    {
        if (devConfig->path1Enable)
        {
            sysClkStatus = Cy_SysClk_ClkPathSetSource(CY_PRA_CLKPATH_1, devConfig->path1Src);
            if (CY_SYSCLK_SUCCESS != sysClkStatus)
            {
                return CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX1;
            }
        }
        else
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX1;
        }

