aws-samples/aws-stm32-ml-at-edge-accelerator/stm32/Middleware/ARM/trusted-firmware-m/platform/ext/target/cypress/psoc64/libs/mtb-pdl-cat1/drivers/source/cy_pra_cfg.c
    }

    if (CY_SRSS_NUM_PLL >= CY_PRA_CLKPLL_1)
    {
        if(Cy_SysClk_PllIsEnabled(CY_PRA_CLKPLL_1))
        {
            /* Disables PLL0 when its state changes ENABLE -> DISABLE */
            if(!devConfig->pll0Enable)
            {
                SystemCoreClockUpdate();
                sysClkStatus = Cy_SysClk_PllDisable(CY_PRA_CLKPLL_1);

                if (CY_SYSCLK_SUCCESS != sysClkStatus)
                {
                    return CY_PRA_STATUS_ERROR_PROCESSING_PLL0;
                }
            }
        }
        /* When the PLL0 state changes DISABLE -> ENABLE, enable only PLL0.
         * Ignore, if PLL0 is already enabled */
        else
        {
            if(devConfig->pll0Enable)
            {
                const cy_stc_pll_manual_config_t pll0Config =
                {
                    .feedbackDiv = devConfig->pll0FeedbackDiv,
                    .referenceDiv = devConfig->pll0ReferenceDiv,
                    .outputDiv = devConfig->pll0OutputDiv,
                    .lfMode = devConfig->pll0LfMode,
                    .outputMode = devConfig->pll0OutputMode,
                };

                SystemCoreClockUpdate();
                status = Cy_PRA_PllInit(CY_PRA_CLKPLL_1, &pll0Config);

                if (CY_PRA_STATUS_SUCCESS != status)
                {
                    return CY_PRA_STATUS_ERROR_PROCESSING_PLL0;
                }
            }
        }
    }

    if (CY_SRSS_NUM_PLL >= CY_PRA_CLKPLL_2)
    {
        if(Cy_SysClk_PllIsEnabled(CY_PRA_CLKPLL_2))
        {
            /* Disables PLL0 when its state changes ENABLE -> DISABLE */
            if(!devConfig->pll1Enable)
            {
                SystemCoreClockUpdate();
                sysClkStatus = Cy_SysClk_PllDisable(CY_PRA_CLKPLL_2);

                if (CY_SYSCLK_SUCCESS != sysClkStatus)
                {
                    return CY_PRA_STATUS_ERROR_PROCESSING_PLL1;
                }
            }
        }
        /* When the PLL1 state changes DISABLE -> ENABLE, enable only PLL1.
         * Ignore, if PLL1 is already enabled */
        else
        {
            if(devConfig->pll1Enable)
            {
                const cy_stc_pll_manual_config_t pll1Config =
                {
                    .feedbackDiv = devConfig->pll1FeedbackDiv,
                    .referenceDiv = devConfig->pll1ReferenceDiv,
                    .outputDiv = devConfig->pll1OutputDiv,
                    .lfMode = devConfig->pll1LfMode,
                    .outputMode = devConfig->pll1OutputMode,
                };

                SystemCoreClockUpdate();
                status = Cy_PRA_PllInit(CY_PRA_CLKPLL_2, &pll1Config);

                if (CY_PRA_STATUS_SUCCESS != status)
                {
                    return CY_PRA_STATUS_ERROR_PROCESSING_PLL1;
                }
            }
        }
    }

    /* Configures the HF clocks */
    if (Cy_SysClk_ClkHfIsEnabled(CY_PRA_CLKHF_1))
    {
        if (!devConfig->clkHF1Enable)
        {
            status = (cy_en_pra_status_t)Cy_SysClk_ClkHfDisable(CY_PRA_CLKHF_1);
            if (CY_PRA_STATUS_SUCCESS != status)
            {
                return CY_PRA_STATUS_INVALID_PARAM_CLKHF1;
            }
        }
    }
    else
    {
        if (devConfig->clkHF1Enable)
        {
            status = Cy_PRA_ClkHfInit(CY_PRA_CLKHF_1, devConfig->hf1Source, devConfig->hf1Divider);
            if (CY_PRA_STATUS_SUCCESS != status)
            {
                return CY_PRA_STATUS_INVALID_PARAM_CLKHF1;
            }
        }
    }

    if (Cy_SysClk_ClkHfIsEnabled(CY_PRA_CLKHF_2))
    {
        if (!devConfig->clkHF2Enable)
        {
            status = (cy_en_pra_status_t)Cy_SysClk_ClkHfDisable(CY_PRA_CLKHF_2);
            if (CY_PRA_STATUS_SUCCESS != status)
            {
                return CY_PRA_STATUS_INVALID_PARAM_CLKHF2;
            }
        }
    }
    else
    {
        if (devConfig->clkHF2Enable)
        {
            status = Cy_PRA_ClkHfInit(CY_PRA_CLKHF_2, devConfig->hf2Source, devConfig->hf2Divider);
            if (CY_PRA_STATUS_SUCCESS != status)
            {
                return CY_PRA_STATUS_INVALID_PARAM_CLKHF2;
            }
        }
    }

    if(CY_PRA_CLKHF_3 < CY_SRSS_NUM_HFROOT)
    {
        if (Cy_SysClk_ClkHfIsEnabled(CY_PRA_CLKHF_3))
        {
            if (!devConfig->clkHF3Enable)
            {
                status = (cy_en_pra_status_t)Cy_SysClk_ClkHfDisable(CY_PRA_CLKHF_3);
                if (CY_PRA_STATUS_SUCCESS != status)
                {
                    return CY_PRA_STATUS_INVALID_PARAM_CLKHF3;
                }
            }
        }
        else
        {
            if (devConfig->clkHF3Enable)
            {
                status = Cy_PRA_ClkHfInit(CY_PRA_CLKHF_3, devConfig->hf3Source, devConfig->hf3Divider);
                if (CY_PRA_STATUS_SUCCESS != status)
                {
                    return CY_PRA_STATUS_INVALID_PARAM_CLKHF3;
                }
            }
        }
    }

    if (CY_PRA_CLKHF_4 < CY_SRSS_NUM_HFROOT)
    {
        if (Cy_SysClk_ClkHfIsEnabled(CY_PRA_CLKHF_4))
        {
            if (!devConfig->clkHF4Enable)
            {
                status = (cy_en_pra_status_t)Cy_SysClk_ClkHfDisable(CY_PRA_CLKHF_4);
                if (CY_PRA_STATUS_SUCCESS != status)
                {
                    return CY_PRA_STATUS_INVALID_PARAM_CLKHF4;
                }
            }
        }
        else
        {
            if (devConfig->clkHF4Enable)
            {
                status = Cy_PRA_ClkHfInit(CY_PRA_CLKHF_4, devConfig->hf4Source, devConfig->hf4Divider);
                if (CY_PRA_STATUS_SUCCESS != status)
                {
                    return CY_PRA_STATUS_INVALID_PARAM_CLKHF4;
                }
            }
        }
    }

    if (CY_PRA_CLKHF_5 < CY_SRSS_NUM_HFROOT)
    {
        if (Cy_SysClk_ClkHfIsEnabled(CY_PRA_CLKHF_5))
        {
            if (!devConfig->clkHF5Enable)
            {
                status = (cy_en_pra_status_t)Cy_SysClk_ClkHfDisable(CY_PRA_CLKHF_5);
                if (CY_PRA_STATUS_SUCCESS != status)
                {
                    return CY_PRA_STATUS_INVALID_PARAM_CLKHF5;
                }
            }
        }
        else
        {
            if (devConfig->clkHF5Enable)
            {
                status = Cy_PRA_ClkHfInit(CY_PRA_CLKHF_5, devConfig->hf5Source, devConfig->hf5Divider);
                if (CY_PRA_STATUS_SUCCESS != status)
                {
                    return CY_PRA_STATUS_INVALID_PARAM_CLKHF5;
                }
            }
        }
    }

    /* Configures miscellaneous clocks */
    if (Cy_SysClk_ClkTimerIsEnabled())
    {
        if (!devConfig->clkTimerEnable)
        {
            Cy_SysClk_ClkTimerDisable();
        }
    }
    /* When the TIMER state changes DISABLE -> ENABLE, enable only TIMER.
     * Ignore, if TIMER is already enabled */
    else
    {
        if (devConfig->clkTimerEnable)
        {
            Cy_PRA_ClkTimerInit(devConfig->clkTimerSource, devConfig->clkTimerDivider);
        }
    }

    if (Cy_SysClk_ClkPumpIsEnabled())
    {
        if (!devConfig->clkPumpEnable)
        {
            Cy_SysClk_ClkPumpDisable();
        }
    }
    /* When the PUMP state changes DISABLE -> ENABLE, enable only PUMP.
     * Ignore, if PUMP is already enabled */
    else
    {
        if (devConfig->clkPumpEnable)
        {
            Cy_PRA_ClkPumpInit(devConfig->pumpSource, devConfig->pumpDivider);
        }
    }

    if (devConfig->clkBakEnable)
    {
        Cy_SysClk_ClkBakSetSource(devConfig->clkBakSource);
    }

    status = Cy_PRA_IloHibernateOn(devConfig->iloHibernateON);
    if (CY_PRA_STATUS_SUCCESS != status)
    {
        return status;
    }

    /* Configures the default-enabled clocks */
    if (Cy_SysClk_IloIsEnabled())
    {
        if (!devConfig->iloEnable)
        {
            /* Wait 4 ILO cycles before it is disabled */
            Cy_SysLib_DelayUs(ILO_DISABLE_DELAY_US);

