aws-samples/aws-stm32-ml-at-edge-accelerator/stm32/Middleware/ARM/trusted-firmware-m/platform/ext/target/cypress/psoc64/libs/mtb-pdl-cat1/drivers/source/cy_pra_cfg.c
            status = Cy_PRA_IloDisable();
            if (CY_PRA_STATUS_SUCCESS != status)
            {
                return status;
            }
        }
    }
    /* When the ILO state changes DISABLE -> ENABLE, enable only ILO.
     * Ignore, if ILO is already enabled */
    else
    {
        if (devConfig->iloEnable)
        {
            status = Cy_PRA_IloEnable();
            if (CY_PRA_STATUS_SUCCESS != status)
            {
                return status;
            }
        }
    }

    /* SYSCLK MFO INIT */
    /* SYSCLK MF INIT */

    /* Sets accurate flash wait states */
    if ((devConfig->powerEnable) && (devConfig->clkHF0Enable))
    {
        Cy_SysLib_SetWaitStates(devConfig->ulpEnable, devConfig->hf0OutFreqMHz);
    }

    /* Updates the System Core Clock values for the correct Cy_SysLib_Delay functioning.
     * This function is called before every PDL function where the Cy_SysLib_Delay
     * function is used.
     */
    SystemCoreClockUpdate();

#endif /* (CY_CPU_CORTEX_M4) */

    return (status);
}


#if (CY_CPU_CORTEX_M0P) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_PRA_CloseSrssMain2
****************************************************************************//**
*
* Restricts the access to the SRSS_MAIN2 region, which includes the following
* registers: SRSS_TST_DDFT_SLOW_CTL_REG and SRSS_TST_DDFT_FAST_CTL_REG.
*
* The function is called from \ref Cy_SysPm_CpuEnterDeepSleep() only for
* the PSOC6ABLE2 devices.
*
*******************************************************************************/
#if defined(CY_DEVICE_PSOC6ABLE2)
    CY_SECTION_RAMFUNC_BEGIN
    #if !defined (__ICCARM__)
        CY_NOINLINE
    #endif
#endif /* defined(CY_DEVICE_PSOC6ABLE2) */
void Cy_PRA_CloseSrssMain2(void)
{
    #if defined(CY_DEVICE_PSOC6ABLE2)
        /* Turn off PC_MATCH for SRSS fixed PPU */
        uint32_t slaveAtt = PERI_GR_PPU_SL_SRSS->ATT0;
        slaveAtt &= ~PERI_GR_PPU_SL_ATT0_PC_MATCH_Msk;
        PERI_GR_PPU_SL_SRSS->ATT0 = slaveAtt;

        /* Disable programmable PPUs #2 and #3 */
        PERI_PPU_PR_ATT0(PERI_PPU_PR2) &= ~_VAL2FLD(PERI_PPU_PR_ATT0_ENABLED, CY_PROT_STRUCT_ENABLE);
        PERI_PPU_PR_ATT0(PERI_PPU_PR3) &= ~_VAL2FLD(PERI_PPU_PR_ATT0_ENABLED, CY_PROT_STRUCT_ENABLE);
    #endif /* defined(CY_DEVICE_PSOC6ABLE2) */
}
#if defined(CY_DEVICE_PSOC6ABLE2)
    CY_SECTION_RAMFUNC_END
#endif /* defined(CY_DEVICE_PSOC6ABLE2) */


/*******************************************************************************
* Function Name: Cy_PRA_OpenSrssMain2
****************************************************************************//**
*
* Restores the access to the SRSS_MAIN2 region, which was restricted by
* Cy_PRA_CloseSrssMain2.
*
* The function is called from \ref Cy_SysPm_CpuEnterDeepSleep() only for
* the CYB06xx7 devices.
*
*******************************************************************************/
#if defined(CY_DEVICE_PSOC6ABLE2)
    CY_SECTION_RAMFUNC_BEGIN
    #if !defined (__ICCARM__)
        CY_NOINLINE
    #endif
#endif /* defined(CY_DEVICE_PSOC6ABLE2) */
void Cy_PRA_OpenSrssMain2(void)
{
    #if defined(CY_DEVICE_PSOC6ABLE2)
        /* Turn on PC_MATCH for SRSS fixed PPU */
        uint32_t slaveAtt = PERI_GR_PPU_SL_SRSS->ATT0;
        slaveAtt |= PERI_GR_PPU_SL_ATT0_PC_MATCH_Msk;
        PERI_GR_PPU_SL_SRSS->ATT0 = slaveAtt;

        /* Enable programmable PPUs #2 and #3 */
        PERI_PPU_PR_ATT0(PERI_PPU_PR2) |= _VAL2FLD(PERI_PPU_PR_ATT0_ENABLED, CY_PROT_STRUCT_ENABLE);
        PERI_PPU_PR_ATT0(PERI_PPU_PR3) |= _VAL2FLD(PERI_PPU_PR_ATT0_ENABLED, CY_PROT_STRUCT_ENABLE);
    #endif /* defined(CY_DEVICE_PSOC6ABLE2) */
}
#if defined(CY_DEVICE_PSOC6ABLE2)
    CY_SECTION_RAMFUNC_END
#endif /* defined(CY_DEVICE_PSOC6ABLE2) */

#endif /* (CY_CPU_CORTEX_M0P) || defined (CY_DOXYGEN) */

#endif /* (CY_DEVICE_SECURE) */

/* [] END OF FILE */
